FROM node:14.15.1-alpine

ARG WORKDIR

# HOME：ホームディレクトリを指定(＝cdコマンドの戻り値)
ENV HOME=/${WORKDIR} \
    # LANG：ロケールを指定するもの。ロケール…使用する言語や単位(通貨や日付・その並び順)を定義したもの
    LANG=C.UTF-8 \
    # TZ：タイムゾーンの指定
    TZ=Asia/Tokyo \
    # コンテナのNuxt.jsをブラウザから見れるようにするためにip:0.0.0.0に紐付ける
    # ローカルで開発してサーバーを起動する時は何も設定しなくてもlocalhost:3000(127.0.0.1:3000)にアクセスすればブラウザからNuxtの画面を見れるが、
    # コンテナは外部からのアクセス扱いとなるため、localhost:3000(127.0.0.1:3000)にアクセスしてもブラウザから見ることができない。
    # そのため、localhost:3000(0.0.0.0:3000)としてhostのipアドレスを0.0.0.0に変更する必要がある
    HOST=0.0.0.0

WORKDIR ${HOME}
